Autodesk.Revit.ApplicationServices.Application.ExternalDataTypeUpdatedDataSourceIntoDocument
Subscribe to the ExternalDataTypeUpdatingDataSourceIntoDocument event to be notified when an ExternalDataType has updated its external data source into Revit Document.
Since:
2025.2

Autodesk.Revit.ApplicationServices.Application.ExternalDataTypeUpdatingDataSourceIntoDocument
Subscribe to the ExternalDataTypeUpdatingDataSourceIntoDocument event to be notified when an ExternalDataType is updating its external data source into Revit Document.
Since:
2025.2

Autodesk.Revit.ApplicationServices.Application.ExtendedApiToConfigure
Subscribe to this event for configuring Extended APIs.
Since:
2025

Autodesk.Revit.ApplicationServices.Application.IsFeatureEnabledInLaunchDarkly(System.String,System.Boolean)
Determines if the specified feature is enabled in Launch Darkly.
strFeatureName:
The feature name you want to ask Launch Darkly about
fallbackValue:
The fallback value in case Launch Darkyl cannot be reached.
Returns:
True if Launch Darkly flag is on
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.ApplicationServices.Application.OpenDocumentFile(Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.OpenOptions)
Opens a document from disk or cloud.
Remarks:
This method opens the document into memory but does not make it visible to the user in any way.
If the user currently has ownership of elements in this model and there is no local model on this machine,
Revit will post a warning.
modelPath:
The file to be opened.
openOptions:
Options for opening the file.
Returns:
The opened document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The modelPath to be opened is empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.CannotOpenBothCentralAndLocalException:
Cannot open the local model and the central model in the same Revit session. You can close one to open the other in the same Revit session.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The model on the RevitServer is being accessed by other users.
-or-
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Revit encountered serious errors while trying to open the central model.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.CorruptModelException:
There are too many corrupt elements to open this model.
Throws Autodesk.Revit.Exceptions.FileAccessException:
File cannot be opened in Revit LT because it was last saved in a version of Revit prior to 8.1.
-or-
File has an invalid extension. Try changing the file's extension and opening it again.
-or-
File was saved by an application that was not developed or licensed by Autodesk.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
The modelPath to be opened doesn't exist.
-or-
File Not Found
Throws Autodesk.Revit.Exceptions.InsufficientResourcesException:
This computer does not have enough memory, disk space, or other necessary resource to open the model.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Open is temporarily disabled.
-or-
The cloud model is not saved in current release of Revit.
-or-
The model is not allowed to access.
-or-
The document can not be opened.
-or-
Revit cannot save the transmitted model as a new central because it is already opened.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Opening was canceled by the user or by an API event callback.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the cloud model.
Throws Autodesk.Revit.Exceptions.ServerModelCorruptedException:
The central model is corrupted.
This exception is treated starting from Revit 2025.2.
Throws Autodesk.Revit.Exceptions.WrongUserException:
The local file is not owned by the current user, who therefore is not allowed to modify it.
Since:
2013

Autodesk.Revit.ApplicationServices.Application.LSShareVersion
The proper Localization Services Share location for the current release.
For example, "Dev" for latest, "Ship_2_0" for 2027.2.0, etc.
Remarks:
Internal api used in testing to determine the correct LSShareVersion to use for a given Revit version.

Autodesk.Revit.ApplicationServices.Application.CreateInstanceWithExtendedApiServices(System.Object[])
Create an instnce of the specified type that depends on Extended API services.
additionalParameters: Parameters that are not provided by Extended API services.
Instance of the specified type.
Since:
2025
Remarks:
This method's accessibility will be changed to "public", when the Extended RevitAPIs
are ready to release to 3rd-party developers.

Autodesk.Revit.ApplicationServices.Application.GetExtendedApiService
Gets extended API service of the specified type.
Object of the extended API service.
Since:
2025
Remarks:
This method's accessibility will be changed to "public", when the Extended RevitAPIs
are ready to release to 3rd-party developers.

Autodesk.Revit.ApplicationServices.Application.GetExtendedApiServices
Gets the IServiceCollection that is used for configuring extended APIs.
IServiceCollection.
Since:
2025

Autodesk.Revit.ApplicationServices.Application.ValidateUserConfigurationSettings(System.Boolean)
Validates and attempts to repair, if invalid, the current user configuration file.
Remarks:
User configuration files are optional settings for things like Dialog positioning etc.
The file is non-existent until configs get saved etc. and have been prone to corruption.
Given the optional nature of the file, if the user configuration is found to be in a corrupt state, an informational
crumb is journaled and the user configuration reset to a valid state to avoid issues accessing the settings. Pass true if
you wish to get an exception if the reset of a failed reset, false will just ignore the reset failure. In either case, the
processing of the throw etc. is done after the information is journaled.
bThrowOnFailedReset: true if attempt to reset a corrupt configuration should throw, false to ignore failure to reset.
Throws System.Configuration.ConfigurationErrorsException:
A corrupt configuration detected and failed to reset.

Autodesk.Revit.ApplicationServices.Application.AddToApplicationPath(System.String)
Adds the specified path to the end of the Application's path environment.
path: path to append.
Throws Autodesk.Revit.Exceptions.ArgumentException: Path is null or empty.
Returns: true if successful
Since: 2025